package com.example.seebha

object Azkars {

    fun getMorningAzkars():ArrayList<Zeekr>{
        val morningAzkarsList = ArrayList<Zeekr>()

        /*val morningZeekr#number = Zeekr(
            #id,
            "هنا",
            #number of repetitions
        )
        morningAzkarsList.add(morningZeekr#number)*/

        val morningZeekr1 =Zeekr(
            0,
            "الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ.",
            1
        )
        morningAzkarsList.add(morningZeekr1)

        val morningZeekr2 = Zeekr(
            1,
            "{ ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ\u2060تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ\u2060تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ }\n" +
                    "[سُورَةُ البَقَرَةِ: ٢٥٥]",
            1
        )
        morningAzkarsList.add(morningZeekr2)

        val morningZkker3 = Zeekr(
            2,
            "{ قُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ (٣) وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ (٤) }\n" +
                    "[سُورَةُ الإِخۡلَاصِ: ١-٤]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) }\n" +
                    "[سُورَةُ الفَلَقِ: ١-٥]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦) }\n" +
                    "[سُورَةُ النَّاسِ: ١-٦]\n",
            3
        )
        morningAzkarsList.add(morningZkker3)

        val morningZkker4 = Zeekr(
            3,
            "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.",
            1
        )
        morningAzkarsList.add(morningZkker4)

        val morningZkker5 = Zeekr(
            4,
            "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ.",
            1
        )
        morningAzkarsList.add(morningZkker5)

        val morningZkker6 = Zeekr(
            5,
            "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ.",
            1
        )
        morningAzkarsList.add(morningZkker6)

        val morningZkker7 = Zeekr(
            6,
            "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ.",
            4
        )
        morningAzkarsList.add(morningZkker7)

        val morningZkker8 = Zeekr(
            7,
            "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
            1
        )
        morningAzkarsList.add(morningZkker8)

        val morningZkker9 = Zeekr(
            8,
            "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ.",
            3
        )
        morningAzkarsList.add(morningZkker9)

        val morningZkker10 = Zeekr(
            9,
            "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.",
            7
        )
        morningAzkarsList.add(morningZkker10)

        val morningZkker11 = Zeekr(
            10,
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
            1
        )
        morningAzkarsList.add(morningZkker11)

        val morningZkker12 = Zeekr(
            11,
            "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى  نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
            1
        )
        morningAzkarsList.add(morningZkker12)

        val morningZkker13 = Zeekr(
            12,
            "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.",
            3
        )
        morningAzkarsList.add(morningZkker13)

        val morningZkker14 = Zeekr(
            13,
            "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ - صلى الله عليه وسلم - نَبِيّاً.",
            3
        )
        morningAzkarsList.add(morningZkker14)

        val morningZkker15 = Zeekr(
            14,
            "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
            1
        )
        morningAzkarsList.add(morningZkker15)

        val morningZkker16 = Zeekr(
            15,
            "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُـمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ:فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ.",
            1
        )
        morningAzkarsList.add(morningZkker16)

        val morningZkker17 = Zeekr(
            16,
            "أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ - صلى الله عليه وسلم -، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ.",
            1
        )
        morningAzkarsList.add(morningZkker17)

        val morningZkker18 = Zeekr(
            17,
            "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
            100
        )
        morningAzkarsList.add(morningZkker18)

        val morningZkker19 = Zeekr(
            18,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                    "أَوْ مرَّةً واحدةً عندَ الكَسَلِ.",
            10
        )
        morningAzkarsList.add(morningZkker19)

        val morningZkker20 = Zeekr(
            19,
            "لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
            100
        )
        morningAzkarsList.add(morningZkker20)

        val morningZkker21 = Zeekr(
            20,
            "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ.",
            3
        )
        morningAzkarsList.add(morningZkker21)

        val morningZkker22 = Zeekr(
            21,
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً.",
            1
        )
        morningAzkarsList.add(morningZkker22)

        val morningZkker23 = Zeekr(
            22,
            "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
            100
        )
        morningAzkarsList.add(morningZkker23)

        val morningZkker24 = Zeekr(
            23,
            "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ.",
            10
        )
        morningAzkarsList.add(morningZkker24)

        return morningAzkarsList
    }

    fun getNightAzkars():ArrayList<Zeekr>{
        val nightAzkarsList = ArrayList<Zeekr>()

        val nightZeekr1 = Zeekr(
            0,
            "الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ.",
            1
        )
        nightAzkarsList.add(nightZeekr1)

        val nightZeekr2 = Zeekr(
            1,
            "{ ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ\u2060تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ\u2060تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ }\n" +
                    "[سُورَةُ البَقَرَةِ: ٢٥٥]",
            1
        )
        nightAzkarsList.add(nightZeekr2)

        val nightZeekr3 = Zeekr(
            2,
            "{ قُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ (٣) وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ (٤) }\n" +
                    "[سُورَةُ الإِخۡلَاصِ: ١-٤]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) }\n" +
                    "[سُورَةُ الفَلَقِ: ١-٥]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦) }\n" +
                    "[سُورَةُ النَّاسِ: ١-٦]\n",
            3
        )
        nightAzkarsList.add(nightZeekr3)

        val nightZeekr4 = Zeekr(
            3,
            "أمسينا وأمسى الملك للَّه، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة، وشر ما بعدهاُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْر.",
            1
        )
        nightAzkarsList.add(nightZeekr4)

        val nightZeekr5 = Zeekr(
            4,
            "اللَّهم بك أمسينا، وبك أصبحنا، وبك نحيا، وبك نموت، وإليك المصير.",
            1
        )
        nightAzkarsList.add(nightZeekr5)

        val nightZeekr6 = Zeekr(
            5,
            "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ.",
            1
        )
        nightAzkarsList.add(nightZeekr6)

        val nightZeekr7 = Zeekr(
            6,
            "اللَّهم إني أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُك.َ",
            4
        )
        nightAzkarsList.add(nightZeekr7)

        val nightZeekr8 = Zeekr(
            7,
            "اللَّهم ما أمسى بي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ.",
            1
        )
        nightAzkarsList.add(nightZeekr8)

        val nightZeekr9 = Zeekr(
            8,
            "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي " +
                    "فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ " +
                    "إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ.",
            3
        )
        nightAzkarsList.add(nightZeekr9)

        val nightZeekr10 = Zeekr(
            9,
            "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم.ِ",
            7
        )
        nightAzkarsList.add(nightZeekr10)

        val nightZeekr11 = Zeekr(
            10,
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
            1
        )
        nightAzkarsList.add(nightZeekr11)

        val nightZeekr12 = Zeekr(
            11,
            "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى  نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِم.ٍ",
            1
        )
        nightAzkarsList.add(nightZeekr12)

        val nightZeekr13 = Zeekr(
            12,
            "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.",
            3
        )
        nightAzkarsList.add(nightZeekr13)

        val nightZeekr14 = Zeekr(
            13,
            "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ - صلى الله عليه وسلم - نَبِيّاً.",
            3
        )
        nightAzkarsList.add(nightZeekr14)

        val nightZeekr15 = Zeekr(
            14,
            "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن.ٍ",
            1
        )
        nightAzkarsList.add(nightZeekr15)

        val nightZeekr16 = Zeekr(
            15,
            "أمسينا وأمسى الملك للَّه ربّ العالمين اللَّهم إني أسألك خير هذه الليلة: فتحها، ونصرها، ونورها، وبركتها، وهداها، وأعوذ بك من شر ما فيها، وشر ما بعدها.",
            1
        )
        nightAzkarsList.add(nightZeekr16)

        val nightZeekr17 = Zeekr(
            16,
            "أمسينا على فطرة الإسلام، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ - صلى الله عليه وسلم -، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ.",
            1
        )
        nightAzkarsList.add(nightZeekr17)

        val nightZeekr18 = Zeekr(
            17,
            "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.",
            100
        )
        nightAzkarsList.add(nightZeekr18)

        val nightZeekr19 = Zeekr(
            18,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                    "أَوْ مرَّةً واحدةً عندَ الكَسَل.ِ",
            10
        )
        nightAzkarsList.add(nightZeekr19)

        val nightZeekr20 = Zeekr(
            19,
            "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ.",
            100
        )
        nightAzkarsList.add(nightZeekr20)

        val nightZeekr21 = Zeekr(
            20,
            "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
            3
        )
        nightAzkarsList.add(nightZeekr21)

        val nightZeekr22 = Zeekr(
            21,
            "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ.",
            10
        )
        nightAzkarsList.add(nightZeekr22)

        return nightAzkarsList
    }

    fun getWakeUpAzkars():ArrayList<Zeekr>{
        val wakeUpAzkarsList = ArrayList<Zeekr>()

        val wakeUpZeekr1 = Zeekr(
            0,
            "الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ.",
            1
        )
        wakeUpAzkarsList.add(wakeUpZeekr1)

        val wakeUpZeekr2 = Zeekr(
            1,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْ لِي.",
            1
        )
        wakeUpAzkarsList.add(wakeUpZeekr2)

        val wakeUPAzkar3 = Zeekr(
            2,
            "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ.",
            1
        )
        wakeUpAzkarsList.add(wakeUPAzkar3)

        val wakeUpAzkar4 = Zeekr(
            3,
            "{ إِنَّ فِی خَلۡقِ ٱلسَّمَـٰوَ ٰ\u2060تِ وَٱلۡأَرۡضِ وَٱخۡتِلَـٰفِ ٱلَّیۡلِ وَٱلنَّهَارِ لَـَٔایَـٰتࣲ لِّأُو۟لِی ٱلۡأَلۡبَـٰبِ (١٩٠) ٱلَّذِینَ یَذۡكُرُونَ ٱللَّهَ قِیَـٰمࣰا وَقُعُودࣰا وَعَلَىٰ جُنُوبِهِمۡ وَیَتَفَكَّرُونَ فِی خَلۡقِ ٱلسَّمَـٰوَ ٰ\u2060تِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَـٰذَا بَـٰطِلࣰا سُبۡحَـٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ (١٩١) رَبَّنَاۤ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَیۡتَهُۥۖ وَمَا لِلظَّـٰلِمِینَ مِنۡ أَنصَارࣲ (١٩٢) رَّبَّنَاۤ إِنَّنَا سَمِعۡنَا مُنَادِیࣰا یُنَادِی لِلۡإِیمَـٰنِ أَنۡ ءَامِنُوا۟ بِرَبِّكُمۡ فَـَٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَیِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ (١٩٣) رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا یَوۡمَ ٱلۡقِیَـٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِیعَادَ (١٩٤) فَٱسۡتَجَابَ لَهُمۡ رَبُّهُمۡ أَنِّی لَاۤ أُضِیعُ عَمَلَ عَـٰمِلࣲ مِّنكُم مِّن ذَكَرٍ أَوۡ أُنثَىٰۖ بَعۡضُكُم مِّنۢ بَعۡضࣲۖ فَٱلَّذِینَ هَاجَرُوا۟ وَأُخۡرِجُوا۟ مِن دِیَـٰرِهِمۡ وَأُوذُوا۟ فِی سَبِیلِی وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنۡهُمۡ سَیِّـَٔاتِهِمۡ وَلَأُدۡخِلَنَّهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ ثَوَابࣰا مِّنۡ عِندِ ٱللَّهِۚ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلثَّوَابِ (١٩٥) لَا یَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِینَ كَفَرُوا۟ فِی ٱلۡبِلَـٰدِ (١٩٦) مَتَـٰعࣱ قَلِیلࣱ ثُمَّ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ (١٩٧) لَـٰكِنِ ٱلَّذِینَ ٱتَّقَوۡا۟ رَبَّهُمۡ لَهُمۡ جَنَّـٰتࣱ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا نُزُلࣰا مِّنۡ عِندِ ٱللَّهِۗ وَمَا عِندَ ٱللَّهِ خَیۡرࣱ لِّلۡأَبۡرَارِ (١٩٨) وَإِنَّ مِنۡ أَهۡلِ ٱلۡكِتَـٰبِ لَمَن یُؤۡمِنُ بِٱللَّهِ وَمَاۤ أُنزِلَ إِلَیۡكُمۡ وَمَاۤ أُنزِلَ إِلَیۡهِمۡ خَـٰشِعِینَ لِلَّهِ لَا یَشۡتَرُونَ بِـَٔایَـٰتِ ٱللَّهِ ثَمَنࣰا قَلِیلًاۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡۗ إِنَّ ٱللَّهَ سَرِیعُ ٱلۡحِسَابِ (١٩٩) یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱصۡبِرُوا۟ وَصَابِرُوا۟ وَرَابِطُوا۟ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ (٢٠٠) }\n" +
                    "[سُورَةُ آلِ عِمۡرَانَ: ١٩٠-٢٠٠]\n",
            1
        )
        wakeUpAzkarsList.add(wakeUpAzkar4)

        return wakeUpAzkarsList
    }

    fun getSleepAzkars():ArrayList<Zeekr>{
        val SleepAzkarsList = ArrayList<Zeekr>()

        val sleepZeeker1 = Zeekr(
            0,
            "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا: \n" +
                    "{ قُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ (٣) وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ (٤) }\n" +
                    "[سُورَةُ الإِخۡلَاصِ: ١-٤]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) }\n" +
                    "[سُورَةُ الفَلَقِ: ١-٥]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦) }\n" +
                    "[سُورَةُ النَّاسِ: ١-٦]\n" +
                    "ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ",
            3
        )
        SleepAzkarsList.add(sleepZeeker1)

        val sleepZeeker2 = Zeekr(
            1,
            "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْـــــــــــدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker2)

        val sleepZeeker3 = Zeekr(
            2,
            "{ ءَامَنَ ٱلرَّسُولُ بِمَاۤ أُنزِلَ إِلَیۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَیۡنَ أَحَدࣲ مِّن رُّسُلِهِۦۚ وَقَالُوا۟ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَیۡكَ ٱلۡمَصِیرُ (٢٨٥) لَا یُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَیۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَاۤ إِن نَّسِینَاۤ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَیۡنَاۤ إِصۡرࣰا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِینَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۤۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ (٢٨٦) }\n" +
                    "[سُورَةُ البَقَرَةِ: ٢٨٥-٢٨٦]\n",
            1
        )
        SleepAzkarsList.add(sleepZeeker3)

        val sleepZeeker4 = Zeekr(
            3,
            "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker4)

        val sleepZeeker5 = Zeekr(
            4,
            "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker5)

        val sleepZeeker6 = Zeekr(
            5,
            "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker6)

        val sleepZeeker7 = Zeekr(
            6,
            "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا.",
            1
        )
        SleepAzkarsList.add(sleepZeeker7)

        val sleepZeeker8 = Zeekr(
            7,
            "سُبْحَانَ اللَّهِ.",
            33
        )
        SleepAzkarsList.add(sleepZeeker8)

        val sleepZeeker9 = Zeekr(
            8,
            "الْحَمْدُ لِلَّهِ.",
            33
        )
        SleepAzkarsList.add(sleepZeeker9)

        val sleepZeeker10 = Zeekr(
            9,
            "اللَّهُ أَكْبَرُ.",
            34
        )
        SleepAzkarsList.add(sleepZeeker10)

        val sleepZeeker11 = Zeekr(
            10,
            "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker11)

        val sleepZeeker12 = Zeekr(
            11,
            "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker12)

        val sleepZeeker13 = Zeekr(
            12,
            "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى  نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِم.ٍ",
            1
        )
        SleepAzkarsList.add(sleepZeeker13)

        val sleepZeeker14 = Zeekr(
            13,
            "يَقْرَأُ تَنْزِيلَ السَّجْدَةِ، وَتَبَارَكَ الَّذي بِيَدِهِ الْمُلْكُ.\n" +
                    "اي سورة السجدة و سورة الملك.",
            1
        )
        SleepAzkarsList.add(sleepZeeker14)

        val sleepZeeker15 = Zeekr(
            14,
            "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ.",
            1
        )
        SleepAzkarsList.add(sleepZeeker15)

        return SleepAzkarsList
    }

    fun getAfterSalaAzkars():ArrayList<Zeekr>{
        val AfterSalaAzkarsList = ArrayList<Zeekr>()

        val afterSalaZeekr1 = Zeekr(
          0,
            "أَسْتَغْفِرُ اللَّهَ.",
            3
        )
        AfterSalaAzkarsList.add(afterSalaZeekr1)

        val afterSalaZeekr2 = Zeekr(
            1,
            "اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ.",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr2)

        val afterSalaZeekr3 = Zeekr(
            2,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
            3
        )
        AfterSalaAzkarsList.add(afterSalaZeekr3)

        val afterSalaZeekr4 = Zeekr(
            3,
            "اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ.",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr4)

        val afterSalaZeekr5 = Zeekr(
            4,
            "لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ.",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr5)

        val afterSalaZeekr6 = Zeekr(
            5,
            "سُبْحَانَ اللَّهِ.",
            33
        )
        AfterSalaAzkarsList.add(afterSalaZeekr6)

        val afterSalaZeekr7 = Zeekr(
            6,
            "الْحَمْدُ لِلَّه.ِ",
            33
        )
        AfterSalaAzkarsList.add(afterSalaZeekr7)

        val afterSalaZeekr8 = Zeekr(
            7,
            "اللَّهُ أَكْبَرُ.",
            33
        )
        AfterSalaAzkarsList.add(afterSalaZeekr8)

        val afterSalaZeekr9 = Zeekr(
            8,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr9)

        val afterSalaZeekr10 = Zeekr(
            9,
            "{ قُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ (٢) لَمۡ یَلِدۡ وَلَمۡ یُولَدۡ (٣) وَلَمۡ یَكُن لَّهُۥ كُفُوًا أَحَدُۢ (٤) }\n" +
                    "[سُورَةُ الإِخۡلَاصِ: ١-٤]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ (٢) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِی ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥) }\n" +
                    "[سُورَةُ الفَلَقِ: ١-٥]\n" +
                    "{ قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِی یُوَسۡوِسُ فِی صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦) }\n" +
                    "[سُورَةُ النَّاسِ: ١-٦]\n",
            3
        )
        AfterSalaAzkarsList.add(afterSalaZeekr10)

        val afterSalaZeekr11 = Zeekr(
            10,
            "{ ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَ ٱلۡحَیُّ ٱلۡقَیُّومُۚ لَا تَأۡخُذُهُۥ سِنَةࣱ وَلَا نَوۡمࣱۚ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ\u2060تِ وَمَا فِی ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِی یَشۡفَعُ عِندَهُۥۤ إِلَّا بِإِذۡنِهِۦۚ یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا یُحِیطُونَ بِشَیۡءࣲ مِّنۡ عِلۡمِهِۦۤ إِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرۡسِیُّهُ ٱلسَّمَـٰوَ ٰ\u2060تِ وَٱلۡأَرۡضَۖ وَلَا یَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ }\n" +
                    "[سُورَةُ البَقَرَةِ: ٢٥٥]",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr11)

        val afterSalaZeekr12 = Zeekr(
            11,
            "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                    "عَشْرَ مَرّاتٍ بَعْدَ صَلاةِ الْمَغْرِبِ وَالصُّبْح.ِ\n",
            10
        )
        AfterSalaAzkarsList.add(afterSalaZeekr12)

        val afterSalaZeekr13 = Zeekr(
            12,
            "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً\n" +
                    "بَعْدَ السّلامِ مِنْ صَلاَةِ الفَجْرِ.",
            1
        )
        AfterSalaAzkarsList.add(afterSalaZeekr13)

        return AfterSalaAzkarsList
    }

    fun getMousqueAzkars():ArrayList<Zeekr>{
        val mousqueAzkarsList = ArrayList<Zeekr>()

        val mousqueZeekr1 = Zeekr(
            0,
            "دُعَــاءُ الذَّهَابِ إِلَى الْـمَسْــجِد :ِ \n" +
                    "\n" +
                    "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً.\n" +
                    "(([اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي])) [((وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً))] [((وَهَبْ لِي نُوراً عَلَى نُورٍ))].",
            1
        )
        mousqueAzkarsList.add(mousqueZeekr1)

        val mousqueZeekr2 = Zeekr(
            1,
            "دُعَـــاءُ دُخُــولِ الـمَسْــــجِدِ:\n" +
                    "\n" +
                    "يَبْدَأُ بِرِجْلِهِ الْيُمْنَى، وَيَقُولُ: أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ. \n",
            1
        )
        mousqueAzkarsList.add(mousqueZeekr2)

        val mousqueZeekr3 = Zeekr(
            2,
            "دُعَاءُ الْخُرُوجِ مِنَ الْـمَسْـــجِدِ:\n" +
                    "\n" +
                    "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى وَيَقُولُ: بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ.\n",
            1
        )
        mousqueAzkarsList.add(mousqueZeekr3)

        return mousqueAzkarsList
    }
}